# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 2  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors: 3  # AutoAnchor evolves 3 anchors per P output layer

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],    # 1-P2/4
   [-1, 3, C3, [128]],            # 2
   [-1, 1, SE, [ 128, 16 ] ],
   [-1, 1, Conv, [256, 3, 2]],    # 3-P3/8  =4
   [-1, 6, C3, [256]],            # 4       =5
   [-1, 1, SE, [ 256, 16 ] ],
   [-1, 1, Conv, [512, 3, 2]],    # 5-P4/16 =7
   [-1, 9, C3, [512]],            # 6       =8
   [-1, 1, SE, [ 512, 16 ] ],
   [-1, 1, Conv, [1024, 3, 2]],   # 7-P5/32 =10
   [-1, 3, C3, [1024]],           # 8       =11
   [-1, 1, SE, [ 1024, 16 ] ],
   [-1, 1, SPPF, [1024, 5]],      # 9       =13
  ]

# DAMO-YOLO GFPN Head
head:
  [[-1, 1, Conv, [512, 1, 1]],  # 10 自己加的一个层，减少通道数
   [9, 1, Conv, [512, 3, 2]],
   [[-1, 14], 1, Concat, [1]],
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #14
   [6, 1, Conv, [256, 3, 2]],   # 15
   [[18, -1, 9], 1, Concat, [1]],
   [-1, 3, C3, [512, False]],  # 17

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],
   [-1, 3, C3, [256, False]],  # 20

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 21], 1, Concat, [1]],
   [-1, 3, C3, [512, False]],  # 23

   [21, 1, Conv, [256, 3, 2]],  # 24
   [27, 1, Conv, [256, 3, 2]],  # 25
   [[17, 28, -1], 1, Concat, [1]],
   [-1, 3, C3, [1024, False]],   # 27

   [24, 1, ContextAggregation, []], # 28
   [27, 1, ContextAggregation, []], # 29
   [31, 1, ContextAggregation, []], # 30

   [[32, 33, 34], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]